aalib
abseil-cpp
accountsservice
acl
acpi_call
acpica
adobe-source-code-pro-fonts
adwaita-cursors
adwaita-icon-theme
alpm_octopi_utils
alsa-card-profiles
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
amd-ucode
android-platform
android-sdk
android-sdk-build-tools
android-sdk-cmdline-tools-latest
android-sdk-platform-tools
ani-cli
aom
apache
appstream
apr
apr-util
archlinux-keyring
argon2
aria2
asusctl
at-spi2-core
atkmm
attica5
attr
audit
augeas
autoconf
automake
avahi
awesome
baloo-widgets
baloo5
base
base-devel
bash
bc
binutils
bison
blas
bluez
bluez-libs
bluez-utils
bolt
boost
boost-libs
bridge-utils
brightnessctl
brltty
brotli
bspwm
btrfs-progs
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm
cantarell-fonts
capstone
cblas
cdparanoia
cdrtools
chromaprint
chrono-date
cifs-utils
cinnamon-desktop
clang
cmake
code
code-features
colord
colord-gtk-common
colord-gtk4
colord-sane
compiler-rt
confuse
containerd
convertlit
coreutils
cpio
cppdap
cracklib
cryptsetup
ctpv-git
cuda
cudnn
cups-pk-helper
curl
cython
dart
dav1d
db
db5.3
dbus
dbus-glib
dbus-python
dconf
debootstrap
debugedit
default-cursors
desktop-file-utils
device-mapper
dhcpcd
dialog
diffutils
djvulibre
dkms
dnssec-anchors
docbook-xml
docbook-xsl
docker
dosfstools
dotconf
double-conversion
dtc
duktape
e2fsprogs
ebook-tools
editorconfig-core-c
edk2-ovmf
efibootmgr
efivar
egl-wayland
eglexternalplatform
electron
electron25
enchant
evolution-data-server
exempi
exfatprogs
exiv2
exo
expat
f2fs-tools
faac
faad2
fakeroot
fcft
ffmpeg
ffmpeg4.4
ffmpegthumbnailer
fftw
file
filesystem
findutils
firefox
fish
flac
flex
fluidsynth
flutter
flutter-common
flutter-devel
flutter-engine-android-google-bin
flutter-engine-common-google-bin
flutter-engine-linux-google-bin
flutter-engine-web-google-bin
flutter-gradle
flutter-intellij-patch
flutter-material-fonts-google-bin
flutter-sky-engine-google-bin
flutter-target-android
flutter-target-linux
flutter-target-web
flutter-tool
fmt
folks
fontconfig
fortune-mod
freeglut
freerdp
freetype2
fribidi
fuse-common
fuse2
fuse3
fzf
gawk
gc
gcc
gcc-libs
gcc12
gcc12-libs
gcr
gcr-4
gd
gdb
gdb-common
gdbm
gdk-pixbuf2
gdm
geoclue
geocode-glib-2
geocode-glib-common
gettext
gflags
ghostscript
giflib
git
git-lfs
github-cli
gjs
glib-networking
glib2
glib2-docs
glibc
glibmm
glslang
glu
glycin
gmp
gnome-autoar
gnome-bluetooth-3.0
gnome-desktop
gnome-desktop-4
gnome-desktop-common
gnome-font-viewer
gnome-keyring
gnome-online-accounts
gnome-session
gnome-settings-daemon
gnome-shell
gnome-tweaks
gnu-free-fonts
gnupg
gnutls
go
go-md2man
gobject-introspection-runtime
gom
google-glog
gparted
gperftools
gpgme
gpm
gptfdisk
gradle
graphene
graphicsmagick
graphite
graphviz
grep
grilo
grim
groff
grub
grub-customizer
gruvbox-dark-icons-gtk
gruvbox-material-gtk-theme-git
gsettings-desktop-schemas
gsfonts
gsl
gsm
gsound
gspell
gssdp
gst-editing-services
gst-plugin-gtk
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gst-plugins-good
gstreamer
gtk-doc
gtk-layer-shell
gtk-update-icon-cache
gtk-vnc
gtk2
gtk3
gtk4
gtkmm
gtkmm3
gtksourceview4
gtksourceview5
gts
guile
gulp
gupnp
gupnp-av
gupnp-dlna
gupnp-igd
gzip
harfbuzz
harfbuzz-icu
hicolor-icon-theme
hidapi
highway
hivex
hwdata
hwloc
hyphen
hyprcursor
hyprlang
hyprpaper
iana-etc
icu
iio-sensor-proxy
ijs
imagemagick
imath
imlib2
iniparser
inkscape
intel-oneapi-common
intel-oneapi-compiler-dpcpp-cpp-runtime
intel-oneapi-compiler-dpcpp-cpp-runtime-libs
intel-oneapi-compiler-shared-runtime
intel-oneapi-compiler-shared-runtime-libs
intel-oneapi-mkl
intel-oneapi-openmp
intel-oneapi-tbb
iproute2
iptables
iputils
ipython
iso-codes
jack2
jansson
java-environment-common
java-runtime-common
jbig2dec
jbigkit
jdk-openjdk
jfsutils
jq
js115
json-c
json-glib
jsoncpp
jupyter-nbclient
jupyter-nbconvert
jupyter-nbformat
jupyter-notebook-shim
jupyter-server
jupyterlab
jupyterlab-pygments
kactivities5
karchive5
kauth5
kbd
kbookmarks5
kcmutils5
kcodecs5
kcompletion5
kconfig5
kconfigwidgets5
kcoreaddons5
kcrash5
kdbusaddons5
kdeclarative5
kded5
kdnssd5
kdsoap
kdsoap-ws-discovery-client
kernel-headers-musl
keyutils
kfilemetadata5
kglobalaccel5
kguiaddons5
ki18n5
kiconthemes5
kidletime5
kio-extras
kio5
kirigami2
kitemviews5
kitty
kitty-shell-integration
kitty-terminfo
kjobwidgets5
kmod
knewstuff5
knotifications5
kpackage5
kparts5
krb5
kservice5
ktextwidgets5
kuserfeedback
kwallet5
kwidgetsaddons5
kwindowsystem5
kxmlgui5
l-smash
lame
lapack
lcms2
ldb
ldns
level-zero-loader
lf
lib2geom
lib32-gcc-libs
lib32-glibc
libadwaita
libaio
libao
libappindicator-gtk3
libarchive
libass
libassuan
libasyncns
libatasmart
libavc1394
libavif
libavtp
libb2
libblockdev
libbluray
libbpf
libbs2b
libbsd
libbytesize
libc++
libc++abi
libcaca
libcamera
libcamera-ipa
libcanberra
libcap
libcap-ng
libcdio
libcdio-paranoia
libcdr
libcloudproviders
libcolord
libconfig
libcue
libcups
libdaemon
libdatachannel
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdbusmenu-qt5
libdc1394
libdca
libde265
libdeflate
libdisplay-info
libdmapsharing
libdovi
libdrm
libdv
libdvdnav
libdvdread
libedataserverui4
libedit
libei
libelf
libepoxy
libev
libevdev
libevent
libewf
libexif
libfdk-aac
libffi
libfontenc
libfreeaptx
libgcrypt
libgdata
libgdm
libgee
libgexiv2
libgirepository
libglvnd
libgme
libgnomekbd
libgoa
libgpg-error
libgphoto2
libgrss
libgsf
libgtop
libgudev
libguestfs
libgusb
libgweather-4
libgxps
libhandy
libheif
libibus
libical
libice
libidn
libidn2
libiec61883
libieee1284
libimagequant
libimobiledevice
libinih
libinput
libinstpatch
libiptcdata
libisl
libjpeg-turbo
libjuice
libjxl
libkate
libkexiv2
libksba
liblc3
libldac
libldap
libldm
libliftoff
liblouis
liblqr
liblrdf
libltc
liblzf
libmalcontent
libmanette
libmd
libmediaart
libmfx
libmicrodns
libmm-glib
libmnl
libmodplug
libmpc
libmpcdec
libmpdclient
libmtp
libmysofa
libnautilus-extension
libnbd
libndp
libnet
libnetfilter_conntrack
libnewt
libnfnetlink
libnfs
libnftnl
libnghttp2
libnice
libnl
libnm
libnma
libnma-common
libnma-gtk4
libnotify
libnsl
libnvme
liboauth
libogg
libomxil-bellagio
libopenmpt
libosinfo
libp11-kit
libpaper
libpcap
libpciaccess
libpeas
libpgm
libphonenumber
libpipewire
libplacebo
libplist
libpng
libpng12
libportal
libportal-gtk3
libportal-gtk4
libproxy
libpsl
libpulse
libpwquality
libqdark-git
libraqm
libraw1394
librest
librevenge
librsvg
librsync
libsamplerate
libsasl
libseccomp
libsecret
libshout
libshumate
libsigc++
libslirp
libsm
libsndfile
libsodium
libsoup
libsoup3
libsoxr
libspectre
libspeechd
libsrtp
libssh
libssh2
libstemmer
libsynctex
libsysprof-capture
libtasn1
libteam
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libtorrent-rasterbar
libtpms
libtraceevent
libtracefs
libunistring
libunwind
liburcu
liburing
libusb
libusbmuxd
libutempter
libutf8proc
libuv
libva
libvdpau
libverto
libvirt
libvisio
libvncserver
libvorbis
libvpx
libwacom
libwbclient
libwebp
libwireplumber
libwnck3
libwpd
libwpe
libwpg
libx11
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcrypt-compat
libxcursor
libxcvt
libxdamage
libxdg-basedir
libxdmcp
libxext
libxfce4ui
libxfce4util
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxklavier
libxml2
libxmlb
libxmu
libxnvctrl
libxpm
libxpresent
libxrandr
libxrender
libxres
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libyuv
libzip
licenses
lilv
linux
linux-api-headers
linux-firmware
linux-firmware-whence
linux-g14
linux-g14-headers
llvm-libs
lm_sensors
lmdb
lrzip
lshw
lsof
lsscsi
lua
lua53
lua53-lgi
luajit
lv2
lvm2
lxappearance
lz4
lzo
lzop
m4
magma-cuda
mailcap
make
mbedtls
md4c
mdadm
media-player-info
mesa
meson
minizip
mjpegtools
mkinitcpio
mkinitcpio-busybox
mobile-broadband-provider-info
mod_dnssd
motivate
mpfr
mpg123
mpv
mtdev
mtools
mujs
multipath-tools
musl
mutter
nano
nasm
nccl
ncurses
ndctl
neofetch
neon
net-snmp
net-tools
netpbm
nettle
network-manager-applet
networkmanager
networkmanager-openvpn
nilfs-utils
ninja
nm-connection-editor
node-gyp
nodejs
nodejs-nopt
noto-fonts-emoji
npm
npth
nspr
nss
ntfs-3g
numactl
nvidia-dkms
nvidia-prime
nvidia-settings
nvidia-utils
nvm
obsidian
ocl-icd
onednn
onetbb
onevpl
oniguruma
openal
opencl-nvidia
opencore-amr
opencv
openexr
openjpeg2
openmp
openmpi
openpmix
openssh
openssl
openvpn
opus
orc
os-prober
osinfo-db
ostree
p11-kit
p7zip
pacman
pacman-contrib
pacman-mirrorlist
pahole
pam
pambase
pango
pangomm
papirus-icon-theme
parted
paru
patch
patchelf
pavucontrol
pax-utils
pciutils
pcre
pcre2
pcsclite
perl
perl-error
perl-libintl-perl
perl-mailtools
perl-timedate
phonon-qt5
phonon-qt5-gstreamer
pinentry
pipewire
pipewire-alsa
pipewire-audio
pipewire-media-session
pipewire-pulse
pixman
pkcs11-helper
pkgconf
playerctl
plymouth
polkit
polkit-gnome
polkit-qt5
poppler
poppler-data
poppler-glib
poppler-qt5
popt
portaudio
potrace
power-profiles-daemon
procps-ng
protobuf
protonvpn
protonvpn-cli
protonvpn-gui
psmisc
pulse-native-provider
pybind11
python
python-annotated-types
python-anyio
python-appdirs
python-argcomplete
python-argon2-cffi-bindings
python-argon2_cffi
python-asttokens
python-async-lru
python-atspi
python-attrs
python-autocommand
python-babel
python-bcrypt
python-beautifulsoup4
python-bleach
python-build
python-cachecontrol
python-cairo
python-certifi
python-cffi
python-chardet
python-charset-normalizer
python-click
python-clickgen
python-colorama
python-comm
python-contourpy
python-coverage
python-cryptography
python-cssselect
python-cycler
python-dateutil
python-decorator
python-defusedxml
python-dill
python-distro
python-dnspython
python-exceptiongroup
python-executing
python-fastdtw
python-fastjsonschema
python-filelock
python-fonttools
python-future
python-gmpy2
python-gnupg
python-gobject
python-h11
python-idna
python-importlib-metadata
python-inflect
python-iniconfig
python-installer
python-ipykernel
python-jaraco.classes
python-jaraco.context
python-jaraco.functools
python-jaraco.text
python-jedi
python-jeepney
python-jinja
python-joblib
python-json-logger
python-json5
python-jsonschema
python-jsonschema-specifications
python-jupyter-client
python-jupyter-core
python-jupyter-events
python-jupyterlab-server
python-keyring
python-kiwisolver
python-lockfile
python-lxml
python-markdown-it-py
python-markupsafe
python-matplotlib
python-matplotlib-inline
python-mdurl
python-mistune
python-more-itertools
python-mpmath
python-msgpack
python-nest-asyncio
python-networkx
python-nltk
python-numpy
python-ordered-set
python-outcome
python-overrides
python-packaging
python-pandas
python-pandocfilters
python-parso
python-pexpect
python-pillow
python-pip
python-pipx
python-platformdirs
python-pluggy
python-ply
python-pooch
python-prometheus_client
python-prompt_toolkit
python-protobuf
python-proton-client
python-protonvpn-nm-lib
python-psutil
python-ptyprocess
python-pure-eval
python-pycparser
python-pydantic
python-pydantic-core
python-pyelftools
python-pygments
python-pyopenssl
python-pyparsing
python-pyproject-hooks
python-pyrsistent
python-pyserial
python-pytest
python-pythondialog
python-pytorch-cuda
python-pytz
python-pyxdg
python-pyzmq
python-referencing
python-regex
python-requests
python-rich
python-rpds-py
python-ruamel-yaml
python-ruamel.yaml.clib
python-scikit-learn
python-scipy
python-seaborn
python-secretstorage
python-selenium
python-send2trash
python-setproctitle
python-setuptools
python-six
python-sniffio
python-sortedcontainers
python-soupsieve
python-stack-data
python-sympy
python-systemd
python-threadpoolctl
python-tinycss2
python-toml
python-tomli
python-torchvision-cuda
python-tornado
python-tqdm
python-traitlets
python-trio
python-trio-websocket
python-trove-classifiers
python-typing_extensions
python-uc-micro-py
python-urllib3
python-userpath
python-validate-pyproject
python-wcwidth
python-webencodings
python-websocket-client
python-wheel
python-wsproto
python-yaml
python-zipp
python-zstandard
qbittorrent-dark-git
qca-qt5
qemu-base
qemu-common
qemu-img
qemu-system-x86
qemu-system-x86-firmware
qhull
qmltermwidget
qrencode
qt5-base
qt5-declarative
qt5-graphicaleffects
qt5-location
qt5-multimedia
qt5-quickcontrols
qt5-quickcontrols2
qt5-speech
qt5-svg
qt5-tools
qt5-translations
qt5-wayland
qt5-webchannel
qt5-webengine
qt5-websockets
qt5-x11extras
qt6-base
qt6-svg
qt6-translations
qtermwidget
ragel
raptor
rav1e
readline
recode
reiserfsprogs
rhash
ripgrep
rnnoise
rofi
rog-control-center
rsync
rtkit
rtmpdump
rubberband
runc
rustup
sane
sbc
scdoc
scour
sddm
sddm-sugar-dark
sdl12-compat
sdl2
seabios
seatd
sed
selenium-manager
semver
serd
setconf
shaderc
shadow
shared-mime-info
slang
sleuthkit
smbclient
snappy
sndio
solid5
sonnet5
sord
sound-theme-freedesktop
soundtouch
source-highlight
spandsp
spdlog
speech-dispatcher
speex
speexdsp
spirv-tools
sqlite
squashfs-tools
sratom
srt
startup-notification
strace
sudo
supergfxctl
supermin
svt-av1
svt-hevc
swww
sxiv
syndication5
syntax-highlighting5
sysfsutils
syslinux
systemd
systemd-libs
systemd-sysvcompat
taglib
talloc
tar
tdb
tevent
texinfo
thin-provisioning-tools
thunar
thunar-archive-plugin
tomlplusplus
totem-pl-parser
tpm2-tss
tracker3
tslib
ttf-dejavu
ttf-fira-code
ttf-font-awesome
ttf-hack
ttf-jetbrains-mono
twolame
tzdata
uchardet
udisks2
unzip
upower
usbmuxd
util-linux
util-linux-libs
v4l-utils
vala
vde2
ventoy
verdict
vid.stab
vim
vim-runtime
virtiofsd
virtualbox
virtualbox-host-dkms
vmaf
volume_key
vte-common
vte4
vulkan-headers
vulkan-icd-loader
vulkan-validation-layers
warp-terminal
wavpack
waybar
wayland
wayland-protocols
waypaper-git
webkit2gtk
webkit2gtk-4.1
webkitgtk-6.0
webrtc-audio-processing
webrtc-audio-processing-1
wf-recorder
wget
which
wildmidi
woff2
wolfssl
wpa_supplicant
wpebackend-fdo
x264
x265
xapp
xarchiver
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-errors
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xcb-util-xrm
xcursor-simp1e-gruvbox-dark
xdg-dbus-proxy
xdg-desktop-portal
xdg-desktop-portal-gtk
xdg-user-dirs
xdg-utils
xf86-input-libinput
xfconf
xfsprogs
xkeyboard-config
xmlsec
xorg-font-util
xorg-fonts-encodings
xorg-server
xorg-server-common
xorg-setxkbmap
xorg-xauth
xorg-xcursorgen
xorg-xhost
xorg-xinput
xorg-xkbcomp
xorg-xmessage
xorg-xmodmap
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xset
xorg-xwayland-hidpi-xprop
xorg-xwayland-hidpi-xprop-debug
xorgproto
xtrans
xvidcore
xxhash
xz
yajl
yara
yarn
yay
yelp-xsl
zbar
zeromq
zimg
zip
zlib
zsh
zstd
zvbi
zxing-cpp
